class Cities:
    def __init__(self):
        # self.cities_dict = {
        #     'Карфаген': 'Карфаген',
        #     'Сиракузы': 'Сиракузы',
        #     'Афины': 'Афины',
        #     'Родос': 'Родос',
        #     'Александрия': 'Александрия',
        #     'Тир': 'Тир',
        # }
        self.cities_name_list = [
            "Карфаген 1",
            "Сиракузы 1",
            "Афины 1",
            "Родос 1",
            "Александрия 1",
            "Тир 1"
        ]
        # self.cities_list = {
        #     "Карфаген": "Карфаген, "Сиракузы": "Сиракузы", "Афины", "Родос", "Александрия", "Тир"
        # }

    def cities_available(self):
        return self.cities_name_list


cities = Cities()
